-- Использование базы данных "СистемаУчетаБилетов"
USE СистемаУчетаБилетов;
GO

DECLARE @ИдентификаторЭконом INT, @ИдентификаторБизнес INT, @ИдентификаторVIP INT;
SELECT @ИдентификаторЭконом = ИдентификаторКласса FROM Классы WHERE Название = N'Эконом';
SELECT @ИдентификаторБизнес = ИдентификаторКласса FROM Классы WHERE Название = N'Бизнес';
SELECT @ИдентификаторVIP = ИдентификаторКласса FROM Классы WHERE Название = N'VIP';


-- Наполнение таблицы Автобусы
INSERT INTO Автобусы (НомерАвтобуса, Марка, КоличествоМест, Описание, ИдентификаторКласса)
VALUES
    ('AB123', N'Мерседес', 50, N'Просторный автобус', @ИдентификаторЭконом),
    ('BC456', N'Вольво', 40, N'Удобные сиденья', @ИдентификаторБизнес),
    ('CD789', N'Скания', 45, N'Кондиционер', @ИдентификаторЭконом),
    ('DE012', N'Ивеко', 30, N'Экономичный расход топлива', @ИдентификаторVIP),
    ('EF345', N'МАЗ', 35, N'Надежный и прочный', @ИдентификаторЭконом),
    ('FG678', N'Хюндай', 40, N'Современный дизайн', @ИдентификаторЭконом),
    ('GH901', N'Соларис', 35, N'Комфортабельный салон', @ИдентификаторVIP),
    ('HI234', N'Ман', 50, N'Высокая проходимость', @ИдентификаторБизнес),
    ('IJ567', N'ПАЗ', 30, N'Удобный в городе', @ИдентификаторЭконом),
    ('JK890', N'ГАЗель', 20, N'Маневренный и компактный', @ИдентификаторЭконом),
    ('KL123', N'Фольксваген', 40, N'Комфортные сиденья', @ИдентификаторБизнес),
    ('LM456', N'Форд', 35, N'Просторный багажник', @ИдентификаторЭконом),
    ('MN789', N'Икарус', 45, N'Исторический автобус', @ИдентификаторVIP),
    ('NO012', N'Тойота', 30, N'Надежный и экономичный', @ИдентификаторБизнес),
    ('OP345', N'ЛиАЗ', 35, N'Просторный и комфортный', @ИдентификаторЭконом),
    ('PQ678', N'УАЗ', 20, N'Проходимый вездеход', @ИдентификаторЭконом),
    ('QR901', N'Рено', 40, N'Современные технологии', @ИдентификаторБизнес),
    ('RS234', N'Шкода', 35, N'Высокий уровень безопасности', @ИдентификаторЭконом),
    ('ST567', N'Ниссан', 30, N'Динамичный и стильный', @ИдентификаторVIP),
    ('TU890', N'Лексус', 25, N'Роскошный салон', @ИдентификаторБизнес);
