INSERT INTO Рейсы (НомерРейса, ВремяОтправления, ВремяПрибытия, ИдентификаторАвтобуса, ИдентификаторГородаОтправления,
                   ИдентификаторГородаПрибытия, ЦенаБилета)
VALUES ('ABC127', '2023-06-03 10:00', '2023-06-04 10:00', 1, 2, 3, 30)

INSERT INTO Рейсы (НомерРейса, ВремяОтправления, ВремяПрибытия, ИдентификаторАвтобуса, ИдентификаторГородаОтправления,
                   ИдентификаторГородаПрибытия, ЦенаБилета)
VALUES ('ABC124', '2023-06-08 10:00', '2023-06-09 10:00', 1, 3, 2, 30)

INSERT INTO Рейсы (НомерРейса, ВремяОтправления, ВремяПрибытия, ИдентификаторАвтобуса, ИдентификаторГородаОтправления,
                   ИдентификаторГородаПрибытия, ЦенаБилета)
VALUES ('ABC125', '2023-06-08 10:00', '2023-06-09 10:00', 1, 5, 6, 30)

INSERT INTO Рейсы (НомерРейса, ВремяОтправления, ВремяПрибытия, ИдентификаторАвтобуса, ИдентификаторГородаОтправления,
                   ИдентификаторГородаПрибытия, ЦенаБилета)
VALUES ('ABC126', '2023-05-08 10:00', '2023-05-09 10:00', 1, 5, 6, 30)

